Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: However, if the imported Named Password Policy has different policy settings to that in the database with the same name, then it will be imported with the word "Merged - datetime" appended to its name (where the 'datetime' is the date/time of the Merge) and all entries refering to it will now reference the newly named policy.
ru_ru: В случае, если именованная политика с совпадающим именем имеет другие параметры, к имени импортированной политики добавляется фраза «Объединено дата/время» (где «дата/время» — дата и время слияния). Все соответствующие элементы будут привязаны к ней.

source: However, if the imported Named Password Policy has different policy settings to that in the database with the same name, then it will be imported with the word "Merged - datetime" appended to its name (where the 'datetime' is the date/time of the Merge) and all entries referring to it will now reference the newly named policy.
ru_ru: В случае, если именованная политика с совпадающим именем имеет другие параметры, к имени импортированной политики добавляется фраза «Объединено дата/время» (где «дата/время» — дата и время слияния). Все соответствующие элементы будут привязаны к ней.

source: However, if the imported Named Password Policy has different policy settings to that in the database with the same name, then the policy will be imported with the words "Imported - datetime" appended to its name (where the 'datetime' is the date/time of the Import) and all imported entries refering to it will now reference the newly named policy.
ru_ru: В случае, если именованная политика с совпадающим именем имеет другие параметры, к имени импортированной политики добавляется фраза «Импортировано дата/время» (где «дата/время» — дата и время импорта). Все соответствующие импортированные элементы будут привязаны к ней.

source: However, if the imported Named Password Policy has different policy settings to that in the database with the same name, then the policy will be imported with the words "Imported - datetime" appended to its name (where the 'datetime' is the date/time of the Import) and all imported entries referring to it will now reference the newly named policy.
ru_ru: В случае, если именованная политика с совпадающим именем имеет другие параметры, к имени импортированной политики добавляется фраза «Импортировано дата/время» (где «дата/время» — дата и время импорта). Все соответствующие импортированные элементы будут привязаны к ней.

source: However, if this field is specified anywhere in the AutoType string, it applies to the whole string.
ru_ru: Независимо от того, в каком месте строки автонабора указана эта последовательность, она влияет на набор всей строки.

source: However, if you log off your Windows session, shutdown or restart your PC, then Password Safe may not have the opportunity to prompt you (the exact behaviour depends on the type of shutdown and the version of Windows).
ru_ru: Однако, в некоторых случаях Password Safe не имеет возможности вывести запрос (например, при завершении сеанса Windows, выключении или перезагрузке компьютера возможность вывода предупреждения зависит от версии ОС и особенностей выключения компьютера).

source: However, if you log off your Windows session, shutdown or restart your PC, then PasswordSafe may not have the opportunity to prompt you (the exact behaviour depends on the type of shutdown and the version of Windows).
ru_ru: Однако, в некоторых случаях Password Safe не имеет возможности вывести запрос (например, при завершении сеанса Windows, выключении или перезагрузке компьютера возможность вывода предупреждения зависит от версии ОС и особенностей выключения компьютера).

source: However, if you select a different set, via the Advanced Settings dialog during Compare, then these fields will only be compared during this invocation of Password Safe unless you change then again via the Advance Settings dialog.
ru_ru: Если вы укажете свой список полей для сравнения, он будет использоваться только в текущем экземпляре Password Safe.

source: However, if you specify, for example, "Ctrl + 6" it will not be altered.
ru_ru: Но, «Ctrl + 6» не будет изменяться автоматически.

source: However, if you wish to change the base entry's password, then you should edit the base entry directly.
ru_ru: Если же требуется изменить пароль исходного элемента псевдонима, то для этого необходимо открыть и отредактировать сам исходный элемент.

source: However, it is possible to export a KeePass V2 database as a KeePass V1 database.
ru_ru: Но существует возможность экспортировать контейнер KeePass V2 в формат KeePass V1.

source: However, many web sites now require other information or no information (e.g. a search engine).
ru_ru: Но некоторым сайтам требуются другие данные (или они не требуются вообще).

source: However, many web sites now require other information or no information (e.g., a search engine).
ru_ru: Но некоторым сайтам требуются другие данные (или они не требуются вообще).

source: However, much effort has been put into ensuring automatic and transparent upgrading:
ru_ru: Для того, чтобы сделать переход на новую версию как можно более простым и прозрачным приложено много усилий.

source: However, no history will be lost if an entry has more than this number of entries stored.
ru_ru: Но, если у каких-либо элементов ранее было указано большее значение, история не будет потеряна.

source: However, pressing this combination results in a shortcut of Ctrl+Alt+4.
ru_ru: Но нажатие данной комбинации будет воспринято как Ctrl+Alt+4.

source: However, the undo/redo log is retained so that changes can be undone (or redone) after unlocking.
ru_ru: Но, чтобы была возможность откатить правки после разблокировки контейнера, данные журнала отката/повтора не уничтожаются.

source: However, there is no facility to also export the values contained in these Named Password Policies.
ru_ru: Но в настоящее время нет возможности сохранить в текст параметры именованных политик.

source: However, this makes it difficult to sort or to use when comparing two different export files.
ru_ru: Но, в данном случае, затрудняется сортировка и сравнение экспортированных файлов.

source: However, we have provided XSL Transform files (KPV1_to_PWS.xslt and KPV2_to_PWS.xslt).
ru_ru: Но мы предоставляем XSL-файлы для преобразования их в совместимый формат (KPV1_to_PWS.xslt и KPV2_to_PWS.xslt).

source: However, you may clear the username field, as long as it is being displayed, by entering "[]" during the rename implying an empty value.
ru_ru: Чтобы сбросить имя пользователя при переименовании, введите «[]».

source: Icon List
ru_ru: Список значков

source: If '[autotype]' is found before the URL, then after the URL has been displayed/actioned, Password Safe then perform the AutoType action using this entry's AutoType field, or the default value if not specified.
ru_ru: Если добавлена приставка «[autotype]», то после открытия ссылки производится автонабор по заданным в соответствующем поле правилам.

source: If '[autotype]' is found before the URL, then after the URL has been displayed/actioned, Password Safe then perform the Autotype action using this entry's Autotype field, or the default value if not specified.
ru_ru: Если добавлена приставка «[autotype]», то после открытия ссылки производится автонабор по правилам, указанным в соответствующем поле.

source: If '[autotype]' is found before the URL, then after the URL has been displayed/actioned, Password Safe then performs the AutoType action using this entry's AutoType field, or the default value if not specified.
ru_ru: Если добавлена приставка «[autotype]», то после открытия ссылки производится автонабор по заданным в соответствующем поле правилам.

source: If '{alt}' is put before the URL, then it is passed 'as-is' to the alternate browser, that is, without adding 'http://' if no protocol is specified.
ru_ru: Если указана приставка «{alt}», то ссылка передаётся браузеру без изменений (не добавляется «http://» для ссылок, в которых не указан протокол).

source: If Synchronize is chosen, then a small Advanced dialog is display allowing the user to select which fields to synchronize.
ru_ru: Если выбрано действие «Синхронизировать», отображается диалог, позволяющий указать поля для синхронизации.

source: If Windows supports a Recycle Bin on this media (usually only local disks), it will be moved there.
ru_ru: Файл перемещается в «Корзину», если ОС Windows поддерживает удаление в «Корзину» на данном диске (например, на локальных дисках).

source: If a 'column heading' does not match one of the above, the data in that column will be ignored during import.
ru_ru: Если заголовок не совпадает ни с одним из указанных, данные из этого столбца игнорируются.

source: If a Find hadn't been performed or it had been cleared, then this menu item will be grayed out.
ru_ru: Пункт меню неактивен, если поиск не выполнялся или был отменён.

source: If a KeePass group contains a dot ('.'), it is converted to a forward slash ('/') when added to Password Safe, since dots are used as group delimiters by Password Safe.
ru_ru: Если имя группы в KeePass содержит точку («.»), то при импорте в Password Safe она будет заменена на косую черту («/»), т. к. в Password Safe точка используется в качестве разделителя групп.

source: If a KeePass group contains a dot ('.'), it is converted to a forward slash ('/') when added to Password Safe, since dots are used as group delimiters by to Password Safe.
ru_ru: Если имя группы в KeePass содержит точку («.»), то при импорте в Password Safe она будет заменена на косую черту («/»), т. к. в Password Safe точка используется в качестве разделителя групп.

source: If a Named Password Policy of the same name already exists in the current database and it has the same policy settings as that being copied across, then it will be used by any entries referencing is are merged.
ru_ru: При этом, если в контейнере уже присутствует политика с таким же именем, и её настройки совпадают с импортируемыми, существующая одноимённая политика будет назначена соответствующим элементам.

source: If a Named Password Policy of the same name already exists in the current database and it has the same policy settings as that being imported, then it will be used by any entries referencing it when they are imported.
ru_ru: При этом, если в контейнере уже присутствует политика с таким же именем, и её настройки совпадают с импортируемыми, существующая одноимённая политика будет назначена соответствующим импортированным элементам.

source: If a Notes field multi-line delimiter character has been used, either in a previous Export or using a text editor, enter it here so that, during the Import process, the Notes field will be split into multiple lines by replacing this character by a newline.
ru_ru: Если при экспорте заметок был использован разделитель строк, укажите его, чтобы при импорте он был заменён на перенос строки.

source: If a database is not specified, then the application will prompt the user for a database, which will be opened in read-only mode.
ru_ru: Если контейнер не указан, будет запрошено имя контейнера, который затем будет открыт в режиме «только чтение».

source: If a filter is active, you can export those satisfying the filter conditions to a Password Safe database in the current format.
ru_ru: Если активен фильтр, то можно экспортировать отобранные элементы в текущий формат Password Safe.

source: If a master password is entered that the program considers weak, it will prompt for confirmation.
ru_ru: Если программа решит, что выбранный пароль является слабым, будет выдан запрос подтверждения.

source: If a name of a new group is added to the Group field, that Group will be created.
ru_ru: Если в поле «Группа» указать новое имя, будет создана группа с таким же именем.

source: If an entry is "Dragged & Dropped" into the database from another database.
ru_ru: Элемент был «перетянут» из другого контейнера.

source: If an entry is added during a database merge.
ru_ru: Элементы был добавлен при слиянии контейнеров.

source: If an entry is deleted, it will be removed from the display.
ru_ru: Если элемент был удалён, он не будет отображён.

source: If an entry is duplicated, the new copy will not be included in the display.
ru_ru: Если была создана копия элемента, она не будет отображена после применения фильтра.

source: If an entry is edited so that it no longer satisfies the previous Find, it will still be displayed.
ru_ru: Элемент продолжает отображаться, даже если он был отредактирован и больше не удовлетворяет исходным условиям поиска.

source: If an entry is imported (via text or XML).
ru_ru: Элемент был импортирован (из простого текстового файла или XML-файла).

source: If an entry passes your selection criteria, then the complete entry will be merged into the current database.
ru_ru: Если элемент попадает под условие отбора, он целиком помещается в текущий контейнер.

source: If an entry that uses a Password Policy Name is imported and that name is neither in the current receiving database nor in XML input file, then the resulting entry in the database will revert to using the database's default Password Policy.
ru_ru: Если импортируемый элемент использует именованную политику, которой нет в текущем контейнере и XML-файле, то ему будет назначена «политика по умолчанию».

source: If an entry's '<AutoType>' field is set to 'True' and the '<DefaultSequence>' is not empty, then this is used as the Password Safe's entry's AutoType sequence.
ru_ru: Если для элемента значение <AutoType> равно «True» и значение <DefaultSequence> не пусто, то последнее используется в Password Safe как последовательность для автонабора.

source: If an entry's '<AutoType>' field is set to 'True' and the '<DefaultSequence>' is not empty, then this is used as the Password Safe's entry's Autotype sequence.
ru_ru: Если для элемента значение <AutoType> равно «True» и значение <DefaultSequence> не пусто, то последнее используется в Password Safe как последовательность для автонабора.

source: If any 'column heading' is repeated, only the data in the last one will be added to the entries during import.
ru_ru: Если какой-либо из заголовков повторяется, будут использованы данные из последнего столбца с повторяющимся именем.

source: If changes were made to the database since the last save, you will be prompted to save the database.
ru_ru: Если с момента последнего сохранения контейнер был изменён, вам будет предложено сохранить его.

source: If checked, Password Safe will minimize to the System Tray area.
ru_ru: Если помечено, Password Safe будет сворачиваться в значок в области уведомлений (трее).

source: If checked, Password Safe will minimize to the the System Tray area.
ru_ru: Если помечено, Password Safe будет сворачиваться в значок в области уведомлений (трее).

source: If checked, Password Safe will scan all entries when reading a database (typically when starting up), and display a list of the whose expiration date is N days or less from the current date.
ru_ru: Если помечено, при чтении контейнера (обычно при запуске) Password Safe будет просматривать все элементы и уведомлять, если пароль истекает не позднее чем через N дней.

source: If checked, PasswordSafe will scan all entries when reading a database (typically when starting up), and display a list of the whose expiration date is N days or less from the current date.
ru_ru: Если помечено, при чтении контейнера (обычно при запуске) Password Safe будет просматривать все элементы и уведомлять, если пароль истекает не позднее чем через N дней.

source: If checked, a light grid line will be shown in the dispay list, making it look like a spreadsheet.
ru_ru: Если помечено, будут видны светлые линии сетки, и список станет похож на таблицу.

source: If checked, a light grid line will be shown in the display list, making it look like a spreadsheet.
ru_ru: Если помечено, будут видны светлые линии сетки, и список станет похож на таблицу.

source: If checked, maximized Password Safe will always be the top most window displayed in the monitor, regardless of what other window may have focus.
ru_ru: Если помечено, развёрнутый Password Safe будет находиться поверх всех окон, независимо от того, какое окно имеет фокус ввода.

source: If checked, notes to an hovered item will be shown.
ru_ru: Если помечено, заметки будут отображаться при наведении курсора мыши на элемент.

source: If checked, notes will be displayed by default in edit dialog.
ru_ru: Если помечено, в диалоге редактирования заметки будут видимыми по умолчанию.

source: If checked, passwords that would be hidden in the Add Entry and Edit/View Entry dialogs will be visible by default.
ru_ru: Если помечено, скрытый по умолчанию пароль в диалогах добавления и просмотра/редактирования будет видимым.

source: If checked, passwords will be displayed in curly braces following the user's name in the Nested Tree view.
ru_ru: Если помечено, пароль будет отображаться в фигурных скобках после имени пользователя (в режиме древовидного списка).

source: If checked, the words will automatically be wrapped in the window, without an horizontal scroll bar.
ru_ru: Если помечено, в поле заметок будет использоваться перенос по словам.

source: If checked, this will cause Password Safe to hide his icon in the system tray.
ru_ru: Если помечено, Password Safe будет скрывать значок в области уведомлений.

source: If checked, this will cause Password Safe to start automatically in the System tray when you log on.
ru_ru: Если помечено, при входе в систему Password Safe будет автоматически запускаться и помещаться в область уведомлений.

source: If checked, usernames will be displayed in square brackets following the item's name in the Nested Tree view.
ru_ru: Если помечено, имя пользователя будет отображаться в квадратных скобках после имени элемента (в режиме древовидного списка).

source: If desired, you can specify an alternate browser by putting '[alt]' before the URL, e.g., "[alt]http://www.foo.net".
ru_ru: В случае необходимости можно использовать альтернативный браузер, добавив к ссылке приставку «[alt]» (например, «[alt]http://www.foo.net»).

source: If dropped in a window of another application the result will depend on how that application processes the Tab and Shift+Tab characters.
ru_ru: В окнах других приложений результат зависит от того, как обрабатываются символы Tab и Shift+Tab.

source: If enabled, the value specified is the percentage of Window transparency.
ru_ru: Если включено, указывает уровень прозрачности окна (в процентах).

source: If entries are copied to the database via the results of a database Compare dialog.
ru_ru: Элементы был скопирован из диалога результатов сравнения контейнеров.

source: If it is 'True' but '<DefaultSequence>' is empty, then the '<DefaultAutoTypeSequence>' field from the parent group is used as the Password Safe's entry's AutoType sequence.
ru_ru: Если для элемента значение <AutoType> равно «True», но значение <DefaultSequence> пусто, то используется значение <DefaultAutoTypeSequence> от родительской группы.

source: If it is 'True' but '<DefaultSequence>' is empty, then the '<DefaultAutoTypeSequence>' field from the parent group is used as the Password Safe's entry's Autotype sequence.
ru_ru: Если для элемента значение <AutoType> равно «True», но значение <DefaultSequence> пусто, то используется значение <DefaultAutoTypeSequence> от родительской группы.

source: If it is locked, you will be prompted for the master combination when you try to restore it.
ru_ru: Если контейнер заблокирован, вас попросят ввести мастер-пароль при разворачивании окна приложения.

source: If it is locked, you will be prompted for the master combination when you try to unminimize it.
ru_ru: Если контейнер заблокирован, вас попросят ввести мастер-пароль при разворачивании окна приложения.

source: If it's not there, click on the ellipsis (...) and choose it.
ru_ru: Если это не так, нажмите на кнопку «...» и выберите файл.

source: If item Save database immediately after Edit or Add in menu Manage => Options => Backups is unchecked, changed item will not be saved, but they will be shown coloured.
ru_ru: Если на вкладке Управление→Настройки→Резервные копии снят флажок Сохранять контейнер после вставки или редактирования, изменения не сохраняются автоматически и выделяются цветом.

source: If item Save database immediately after Edit or Add in menu Manage => Options => Backups is unchecked, changed item will not be saved, but they will be shown in a different colour.
ru_ru: Если на вкладке Управление→Настройки→Резервные копии снят флажок Сохранять контейнер после вставки или редактирования, изменения не сохраняются автоматически, а выделяются цветом.

source: If item Save database immediately after Edit or Add in menu Manage → Options → Backups is unchecked, changed item will not be saved immediately, but they will be shown in a different colour.
ru_ru: Если на вкладке Сервис→Настройки→Резервные копии снят флажок Сохранять контейнер после вставки или редактирования, изменения не сохраняются автоматически, а выделяются цветом.

source: If item Save database immediately after Edit or Add in menu Manage → Options → Backups is unchecked, changed item will not be saved, but they will be shown in a different colour.
ru_ru: Если на вкладке Сервис→Настройки→Резервные копии снят флажок Сохранять контейнер после вставки или редактирования, изменения не сохраняются автоматически, а выделяются цветом.

source: If just a filename is given, without a path, it will be searched for in the directory in which the application was invoked unless overridden by the PWS_PREFSDIR environment variable (see its description in the Preferences Section).
ru_ru: Если указано только имя файла (без пути), то поиск файла производится в каталоге, из которого было запущено приложение, но каталог может быть переопределён через переменную окружения PWS_PREFSDIR (см.␣описание в разделе Настройки).

source: If just a filename is given, without a path, it will be searched for in the directory in which the application was invoked.
ru_ru: Если указано только имя файла (без пути), то поиск файла производится в каталоге, из которого было запущено приложение.

source: If neither of these prefixes appear in the URL string, it is placed in the Password Safe's entry's URL field with only {S:FieldName} substitution.
ru_ru: В противном случае строка URL подставляется в поле «Ссылка» с предварительной заменой только последовательностей вида {S:FieldName}.

source: If new entries are added either directly or, say, via Merge, these will also not be displayed as they were not in the database when the last Find operation was performed.
ru_ru: Если элементы были добавлены явно. или через операцию слияния, они не будут отображены, т.␣к. их не было на момент выполнения операции поиска.

source: If no changes have been made since the previous save, or if the database was opened read-only, this choice will be greyed-out.
ru_ru: Если с момента предыдущего сохранения не было изменений, или, если контейнер открыт в режиме «только чтение», данный пункт меню будет заблокирован.

source: If no entry is selected, or the selected entry's URL is blank, this command will be disabled.
ru_ru: Пункт меню недоступен, если элемент не выбран, или для него не задана ссылка.

source: If not active or if there are no current old passwords, the field is removed but not replaced with anything.
ru_ru: Если история паролей отключена, или отсутствуют сохранённые старые пароли, происходит подстановка пустой строки.

source: If not checked, an horizontal scroll bar will appear, if necesarry.
ru_ru: Иначе, при необходимости, будет отображаться горизонтальная полоса прокрутки.
